Комплексная_автоматизация_2_МОМ_2019/src/Catalogs/ЭлементыФинансовыхОтчетов/ЭлементыФинансовыхОтчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЭлементыФинансовыхОтчетов</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <owners>Catalog.ВидыБюджетов</owners>
  <attributes>
    <name>ВидЭлемента</name>
    <type>
      <types>EnumRef.ВидыЭлементовФинансовогоОтчета</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеДляПечати</name>
    <comment>Наименование для печати, представление</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбратныйЗнак</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныйОтбор</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьНастройки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеАналитики</name>
    <type>
      <types>Characteristic.АналитикиСтатейБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>СвязанныйЭлемент</name>
    <type>
      <types>CatalogRef.ЭлементыФинансовыхОтчетов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>РеквизитыВидаЭлемента</name>
    <attributes>
      <name>Реквизит</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.РеквизитыЭлементовФинансовыхОтчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.РеквизитыЭлементовФинансовыхОтчетов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОперандыФормулы</name>
    <attributes>
      <name>Идентификатор</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Операнд</name>
      <type>
        <types>CatalogRef.ЭлементыФинансовыхОтчетов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЭлементыТаблицы</name>
    <attributes>
      <name>Строка</name>
      <type>
        <types>CatalogRef.ЭлементыФинансовыхОтчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>Колонка</name>
      <type>
        <types>CatalogRef.ЭлементыФинансовыхОтчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>Элемент</name>
      <type>
        <types>CatalogRef.ЭлементыФинансовыхОтчетов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеПоля</name>
    <attributes>
      <name>Реквизит</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВыводитьЗаголовок</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВОтдельнойКолонке</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЭлементыОформления</name>
    <attributes>
      <name>Оформление</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>Условие</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипОформляемойОбласти</name>
      <type>
        <types>EnumRef.ТипыОформляемыхОбластейБюджетныхОтчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючЭлементаОформления</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОформляемыеСтроки</name>
    <attributes>
      <name>ЭлементОтчета</name>
      <type>
        <types>CatalogRef.ЭлементыФинансовыхОтчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючЭлементаОформления</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОформляемыеКолонки</name>
    <attributes>
      <name>ЭлементОтчета</name>
      <type>
        <types>CatalogRef.ЭлементыФинансовыхОтчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючЭлементаОформления</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РасшифровкаПолейОтбораЭО</name>
    <attributes>
      <name>ЭлементОтчета</name>
      <type>
        <types>CatalogRef.ЭлементыФинансовыхОтчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючЭлементаОформления</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяПоляОтбора</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяРесурса</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсточникиЗначений</name>
    <attributes>
      <name>Источник</name>
      <type>
        <types>CatalogRef.ЭлементыФинансовыхОтчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>ДобавляемыеЗначенияДокумента</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Комплексная_автоматизация_2_МОМ_2019/src/Enums/ТипыИзмеренийФинансовогоОтчета/ТипыИзмеренийФинансовогоОтчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыИзмеренийФинансовогоОтчета</name>
  <enumValues>
    <name>Аналитика</name>
  </enumValues>
  <enumValues>
    <name>Валюта</name>
  </enumValues>
  <enumValues>
    <name>ИзмерениеРегистра</name>
  </enumValues>
  <enumValues>
    <name>ИзмерениеРегистраБухгалтерии</name>
  </enumValues>
  <enumValues>
    <name>Организация</name>
  </enumValues>
  <enumValues>
    <name>Период</name>
  </enumValues>
  <enumValues>
    <name>Подразделение</name>
  </enumValues>
  <enumValues>
    <name>Субконто</name>
  </enumValues>
  <enumValues>
    <name>Сценарий</name>
  </enumValues>
  <enumValues>
    <name>ФиксированнаяАналитика</name>
  </enumValues>
</mdclass:Enum>

Комплексная_автоматизация_2_МОМ_2019/src/Enums/ВидыЭлементовФинансовогоОтчета/ВидыЭлементовФинансовогоОтчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыЭлементовФинансовогоОтчета</name>
  <enumValues>
    <name>ЗаголовокОтчета</name>
  </enumValues>
  <enumValues>
    <name>НередактируемыйТекст</name>
  </enumValues>
  <enumValues>
    <name>РедактируемыйТекст</name>
  </enumValues>
  <enumValues>
    <name>МонетарныйПоказатель</name>
  </enumValues>
  <enumValues>
    <name>НемонетарныйПоказатель</name>
  </enumValues>
  <enumValues>
    <name>СтатьяБюджетов</name>
  </enumValues>
  <enumValues>
    <name>ВсеСтатьиБюджетов</name>
  </enumValues>
  <enumValues>
    <name>ПоказательБюджетов</name>
  </enumValues>
  <enumValues>
    <name>ВсеПоказателиБюджетов</name>
  </enumValues>
  <enumValues>
    <name>ПроизводныйПоказатель</name>
  </enumValues>
  <enumValues>
    <name>НефинансовыйПоказатель</name>
  </enumValues>
  <enumValues>
    <name>РедактируемоеЗначение</name>
  </enumValues>
  <enumValues>
    <name>ТаблицаПоказателиВСтроках</name>
  </enumValues>
  <enumValues>
    <name>ТаблицаПоказателиВКолонках</name>
  </enumValues>
  <enumValues>
    <name>ТаблицаСложная</name>
  </enumValues>
  <enumValues>
    <name>ЭлементТаблицы</name>
  </enumValues>
  <enumValues>
    <name>Колонки</name>
  </enumValues>
  <enumValues>
    <name>Строки</name>
  </enumValues>
  <enumValues>
    <name>НастройкаЯчеек</name>
  </enumValues>
  <enumValues>
    <name>ЯчейкаТаблицы</name>
  </enumValues>
  <enumValues>
    <name>Измерение</name>
  </enumValues>
  <enumValues>
    <name>Группа</name>
  </enumValues>
  <enumValues>
    <name>ИтогПоГруппе</name>
  </enumValues>
  <enumValues>
    <name>ФормулаПоГруппе</name>
  </enumValues>
</mdclass:Enum>

Комплексная_автоматизация_2_МОМ_2019/src/Catalogs/ЭлементыФинансовыхОтчетов/Forms/ВыборИзмеренийИтога/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	ДеревоЭлементов = ПолучитьИзВременногоХранилища(Параметры.АдресЭлементовОтчета);
	Если ЗначениеЗаполнено(Параметры.АдресТаблицыЭлементов) Тогда
		ТаблицаЭлементов = ПолучитьИзВременногоХранилища(Параметры.АдресТаблицыЭлементов)
	Иначе
		ТаблицаЭлементов = Неопределено;
	КонецЕсли;
	
	Колонка = Неопределено; Строка = Неопределено;
	
	Если ТаблицаЭлементов = Неопределено Тогда
		
		СтрокаДерева = ДеревоЭлементов.Строки.Найти(Параметры.АдресРедактируемогоЭлемента, "АдресСтруктурыЭлемента", Истина);
		КорневойЭлемент = ФинансоваяОтчетностьСервер.КорневойЭлемент(СтрокаДерева, ВидЭлемента("ТаблицаПоказателиВСтроках"));
		ИсточникПодчиненных = Неопределено;
		Если КорневойЭлемент <> Неопределено Тогда
			ИсточникПодчиненных = ФинансоваяОтчетностьСервер.ПодчиненныйЭлемент(КорневойЭлемент, "ВидЭлемента", ВидЭлемента("Колонки"));
			Вышележащие = "Строки";
			Нижележащие = "Колонки";
		КонецЕсли;
		КорневойЭлемент = ФинансоваяОтчетностьСервер.КорневойЭлемент(СтрокаДерева, ВидЭлемента("ТаблицаПоказателиВКолонках"));
		Если КорневойЭлемент <> Неопределено Тогда
			ИсточникПодчиненных = ФинансоваяОтчетностьСервер.ПодчиненныйЭлемент(КорневойЭлемент, "ВидЭлемента", ВидЭлемента("Строки"));
			Вышележащие = "Колонки";
			Нижележащие = "Строки";
		КонецЕсли;
		Если ИсточникПодчиненных = Неопределено Тогда
			ИсточникПодчиненных = ФинансоваяОтчетностьСервер.КорневойЭлемент(СтрокаДерева);
			Вышележащие = "Строки";
			Нижележащие = Неопределено;
		КонецЕсли;
		
		ДополнитьВышестоящимиИзмерениями(СтрокаДерева, Вышележащие);
		ПеречислитьНижележащиеИзмерения(СтрокаДерева, Вышележащие);
		Если Нижележащие <> Неопределено Тогда
			ПеречислитьНижележащиеИзмерения(ИсточникПодчиненных, Нижележащие);
		Иначе
			ВидИтога = 1;
			Элементы.ВидИтога.Доступность = Ложь;
		КонецЕсли;
		
	Иначе
		
		ЯчейкаМатрицы = ТаблицаЭлементов.Найти(Параметры.АдресРедактируемогоЭлемента, "Элемент");
		
		СтрокаДерева = ДеревоЭлементов.Строки.Найти(ЯчейкаМатрицы.Строка, "АдресСтруктурыЭлемента", Истина);
		ДополнитьВышестоящимиИзмерениями(СтрокаДерева, "Строки");
		ПеречислитьНижележащиеИзмерения(СтрокаДерева, "Строки");
		
		КолонкаДерева = ДеревоЭлементов.Строки.Найти(ЯчейкаМатрицы.Колонка, "АдресСтруктурыЭлемента", Истина);
		ДополнитьВышестоящимиИзмерениями(КолонкаДерева, "Колонки");
		ПеречислитьНижележащиеИзмерения(КолонкаДерева, "Колонки");
		
	КонецЕсли;
	
	УстановитьВыбранныеИзмерения();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИспользоватьРасширенныеВозможности(Команда)
	
	УправлениеФормой();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидИтогаПриИзменении(Элемент)
	
	УстановитьТекстНадписи();
	УстановитьВыбранныеИзмерения();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выбрать(Команда)
	
	Закрыть(СписокИзмерений());
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция СписокИзмерений()
	
	Массив = ВыборИзмерений.Выгрузить(Новый Структура("Флаг", Истина)).ВыгрузитьКолонку(1);
	Возврат СтрСоединить(Массив, ", ");
	
КонецФункции

&НаСервере
Процедура ДополнитьВышестоящимиИзмерениями(Знач СтрокаДерева, Источник)
	
	Пока СтрокаДерева <> Неопределено
		И СтрокаДерева.ВидЭлемента <> ВидЭлемента("Строки")
		И СтрокаДерева.ВидЭлемента <> ВидЭлемента("Колонки") Цикл
		
		Если СтрокаДерева.ВидЭлемента = ВидЭлемента("Измерение") Тогда
			
			Представление = ПредставлениеИзмерения(СтрокаДерева);
			
			Если ВыборИзмерений.НайтиСтроки(Новый Структура("ПредставлениеИзмерения", Представление)).Количество() Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяСтрока = ВыборИзмерений.Добавить();
			НоваяСтрока.ПредставлениеИзмерения = Представление;
			НоваяСтрока.ИсточникИзмерения = Источник;
			
		КонецЕсли;
		
		СтрокаДерева = СтрокаДерева.Родитель;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ЗначениеРеквизита(СтрокаДерева, ИмяРеквизита)
	
	Если ЗначениеЗаполнено(СтрокаДерева.АдресСтруктурыЭлемента) Тогда
		Значение = ФинансоваяОтчетностьВызовСервера.ЗначениеДополнительногоРеквизита(
																СтрокаДерева.АдресСтруктурыЭлемента, ИмяРеквизита);
	Иначе
		Значение = ФинансоваяОтчетностьВызовСервера.ЗначениеДополнительногоРеквизита(
																СтрокаДерева.ЭлементОтчета, ИмяРеквизита);
	КонецЕсли;
	
	Возврат Значение;
	
КонецФункции

&НаСервере
Функция ПредставлениеИзмерения(СтрокаДерева)
	
	ТипИзмерения = ЗначениеРеквизита(СтрокаДерева, "ТипИзмерения");
	
	Если ТипИзмерения = Перечисления.ТипыИзмеренийФинансовогоОтчета.Период Тогда
		
		Периодичность = ЗначениеРеквизита(СтрокаДерева, "Периодичность");
		Представление = Строка(Периодичность);
		
	ИначеЕсли ТипИзмерения = Перечисления.ТипыИзмеренийФинансовогоОтчета.Организация Тогда
		
		Представление = "Организация";
		
	ИначеЕсли ТипИзмерения = Перечисления.ТипыИзмеренийФинансовогоОтчета.Подразделение Тогда
		
		Представление = "Подразделение";
		
	ИначеЕсли ТипИзмерения = Перечисления.ТипыИзмеренийФинансовогоОтчета.Сценарий Тогда
		
		Представление = "Сценарий";
		
	ИначеЕсли ТипИзмерения = Перечисления.ТипыИзмеренийФинансовогоОтчета.Валюта Тогда
		
		Представление = "Валюта";
		
	ИначеЕсли ТипИзмерения = Перечисления.ТипыИзмеренийФинансовогоОтчета.ИзмерениеРегистра Тогда
		
		Представление = ЗначениеРеквизита(СтрокаДерева, "ИмяИзмерения");
		
	ИначеЕсли ТипИзмерения = Перечисления.ТипыИзмеренийФинансовогоОтчета.Аналитика
		ИЛИ ТипИзмерения = Перечисления.ТипыИзмеренийФинансовогоОтчета.ФиксированнаяАналитика Тогда
		
		ВидАналитики = ЗначениеРеквизита(СтрокаДерева, "ВидАналитики");
		Представление = Строка(ВидАналитики);
		
	КонецЕсли;
	
	Возврат Представление;
	
КонецФункции

&НаСервере
Процедура ПеречислитьНижележащиеИзмерения(Знач СтрокаДерева, Источник)
	
	Для Каждого ПодчиненнаяСтрока Из СтрокаДерева.Строки Цикл
		
		Если ПодчиненнаяСтрока.ВидЭлемента = ВидЭлемента("Измерение") Тогда
			
			Представление = ПредставлениеИзмерения(ПодчиненнаяСтрока);
			
			Если ВыборИзмерений.НайтиСтроки(Новый Структура("ПредставлениеИзмерения", Представление)).Количество() Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяСтрока = ВыборИзмерений.Добавить();
			НоваяСтрока.ПредставлениеИзмерения = Представление;
			НоваяСтрока.ИсточникИзмерения = Источник;
			
		КонецЕсли;
		
		ПеречислитьНижележащиеИзмерения(ПодчиненнаяСтрока, Источник);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ВидЭлемента(ИмяЭлемента)
	
	#Если Клиент Тогда
		Возврат ПредопределенноеЗначение("Перечисление.ВидыЭлементовФинансовогоОтчета." + ИмяЭлемента);
	#Иначе
		Возврат Перечисления.ВидыЭлементовФинансовогоОтчета[ИмяЭлемента];
	#КонецЕсли
	
КонецФункции

&НаСервере
Процедура УправлениеФормой()
	
	Если Элементы.ИспользоватьРасширенныеВозможности.Заголовок = НСтр("ru = 'Использовать расширенные возможности'") Тогда
		Элементы.ИспользоватьРасширенныеВозможности.Заголовок = НСтр("ru = 'Использовать упрощенные возможности'");
		Элементы.Страницы.ТекущаяСтраница = Элементы.ДетальнаяНастройка;
	Иначе
		Элементы.ИспользоватьРасширенныеВозможности.Заголовок = НСтр("ru = 'Использовать расширенные возможности'");
		Элементы.Страницы.ТекущаяСтраница = Элементы.ПростаяНастройка;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьТекстНадписи()
	
	Если ВидИтога = 0 Тогда
		Элементы.НадписьИтог.Заголовок = НСтр("ru = 'Функция вернет итог по всем значениям по строке отчета'");
	Иначе
		Элементы.НадписьИтог.Заголовок = НСтр("ru = 'Функция вернет итог по всем значениям по колонке отчета'");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВыбранныеИзмерения()
	
	Если ВидИтога Тогда
		Источник = "Строки";
	Иначе
		Источник = "Колонки";
	КонецЕсли;
	
	Для Каждого СтрокаПоиска Из ВыборИзмерений Цикл
		
		СтрокаПоиска.Флаг = СтрокаПоиска.ИсточникИзмерения = Источник;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
